Hi, have the same problem, can you help or need to wait version 2.5.0?

**Terraform**
v1.5.2

**Terraform Provider**
v2.4.1

**VMware vSphere**
7.0.3.01400


**Datasources**
```
data "vsphere_datacenter" "BMDC" {
  name = "BMDC"
}

data "vsphere_compute_cluster" "cluster" {
  name          = "ecs-bmdc-vmcls01"
  datacenter_id = data.vsphere_datacenter.BMDC.id
}

data "vsphere_datastore" "datastore_001" {
  name          = var.datastore[0]
  datacenter_id = data.vsphere_datacenter.BMDC.id
}

data "vsphere_datastore" "datastore_002" {
  name          = var.datastore[1]
  datacenter_id = data.vsphere_datacenter.BMDC.id
}

data "vsphere_network" "devops_network" {
  name          = "Ecosystem|AP_Ecosystem_Stretched|EPG_ECS_DEVOPS-TOOLS_DC-VLAN_1126"
  datacenter_id = data.vsphere_datacenter.BMDC.id
}

data "vsphere_virtual_machine" "template" {
  name          = local.template
  datacenter_id = data.vsphere_datacenter.BMDC.id
}

data "vsphere_storage_policy" "vm" {
  name = "Test VM Storage Policy"
}

data "vsphere_storage_policy" "disk" {
  name = "Test VM Storage Policy"
}
```

**Variables**
```
locals {
  dc               = "BMDC"
  cluster          = "ecs-bmdc-vmcls01"
  resource_pool_id = "terra"
  datastore        = "Datastore1"
  vnic1            = "vl888"
  template         = "Redhat 8.8 Template"
  cpu_count        = "2"
  memory           = "2048"
  disk_label       = "disk0"
  disk_size        = "100"
  disk_thin        = "true"
  disk_eagerly_scrub = "false"
  domain           = "me.local"
  ipv4_net         = "24"
  dns              = ["8.8.8.8", "8.8.4.4"]
  ipv4_gate        = "10.120.0.1"

}

variable "machines" {
  type = map(any)
  default = {
    "VM1" = {
      "name"         = "k8s-master-11"
      "ipv4_add_mgt" = "10.120.0.160"
      "procs"        = 4
      "ram"          = 8192
      "gateway"      = "10.120.0.1"
    }

    "VM2" = {
      "name"         = "k8s-master-12"
      "ipv4_add_mgt" = "10.120.0.161"
      "procs"        = 4
      "ram"          = 8192
      "gateway"      = "10.120.0.1"
    }
  }
}

variable "datastore" {
  type = list(string)
  default = [
    "pt-bmdc-str-PCHFL2246A006-ES-vv-001",
    "pt-bmdc-str-PCHFL2246A006-ES-vv-002",
    "pt-bmdc-str-PCHFL2246A006-ES-vv-003",
    "pt-bmdc-str-PCHFL2246A006-ES-vv-004",
    "pt-bmdc-str-PCHFL2246A006-ES-vv-005",
    "pt-bmdc-str-PCHFL2246A006-ES-vv-006"
  ]
}
```

**Main**
```
terraform {
  required_providers {
    vsphere = {
      source  = "hashicorp/vsphere"
      version = "~> 2.4"
    }
  }
  required_version = ">= 1.2.0"
}

provider "vsphere" {
  user                 = USERNAME
  password             = PASSWORD
  vsphere_server       = IP_SERVER
  allow_unverified_ssl = true
  client_debug = true
}

resource "vsphere_virtual_machine" "vm" {
  for_each         = var.machines
  datastore_id     = data.vsphere_datastore.datastore_001.id
  resource_pool_id = data.vsphere_compute_cluster.cluster.resource_pool_id
  guest_id         = data.vsphere_virtual_machine.template.guest_id

  network_interface {
    network_id = data.vsphere_network.devops_network.id
  }

  name = each.value.name

  num_cpus = each.value.procs
  memory   = each.value.ram

  storage_policy_id = data.vsphere_storage_policy.vm.id

  disk {
    label            = local.disk_label
    size             = local.disk_size
    thin_provisioned = local.disk_thin
    eagerly_scrub = local.disk_eagerly_scrub
    storage_policy_id = data.vsphere_storage_policy.disk.id    
  }

  clone {
    template_uuid = data.vsphere_virtual_machine.template.id

    customize {
      linux_options {
        host_name = each.value.name
        domain    = local.domain
      }
      network_interface {
        ipv4_address    = each.value.ipv4_add_mgt
        ipv4_netmask    = local.ipv4_net
        dns_server_list = local.dns
      }
      ipv4_gateway = local.ipv4_gate
    }
  }
}
```

When i run plan command, everything all right:
```
Terraform will perform the following actions:

  # vsphere_virtual_machine.vm["VM1"] will be created
  + resource "vsphere_virtual_machine" "vm" {
      + annotation                              = (known after apply)
      + boot_retry_delay                        = 10000
      + change_version                          = (known after apply)
      + cpu_limit                               = -1
      + cpu_share_count                         = (known after apply)
      + cpu_share_level                         = "normal"
      + datastore_id                            = "datastore-1022"
      + default_ip_address                      = (known after apply)
      + ept_rvi_mode                            = "automatic"
      + extra_config_reboot_required            = true
      + firmware                                = "bios"
      + force_power_off                         = true
      + guest_id                                = "rhel8_64Guest"
      + guest_ip_addresses                      = (known after apply)
      + hardware_version                        = (known after apply)
      + host_system_id                          = (known after apply)
      + hv_mode                                 = "hvAuto"
      + id                                      = (known after apply)
      + ide_controller_count                    = 2
      + imported                                = (known after apply)
      + latency_sensitivity                     = "normal"
      + memory                                  = 8192
      + memory_limit                            = -1
      + memory_share_count                      = (known after apply)
      + memory_share_level                      = "normal"
      + migrate_wait_timeout                    = 30
      + moid                                    = (known after apply)
      + name                                    = "k8s-master-11"
      + num_cores_per_socket                    = 1
      + num_cpus                                = 4
      + power_state                             = (known after apply)
      + poweron_timeout                         = 300
      + reboot_required                         = (known after apply)
      + resource_pool_id                        = "resgroup-9"
      + run_tools_scripts_after_power_on        = true
      + run_tools_scripts_after_resume          = true
      + run_tools_scripts_before_guest_shutdown = true
      + run_tools_scripts_before_guest_standby  = true
      + sata_controller_count                   = 0
      + scsi_bus_sharing                        = "noSharing"
      + scsi_controller_count                   = 1
      + scsi_type                               = "pvscsi"
      + shutdown_wait_timeout                   = 3
      + storage_policy_id                       = "19ddb546-f1f3-4da7-8058-89af965b9aa3"
      + swap_placement_policy                   = "inherit"
      + tools_upgrade_policy                    = "manual"
      + uuid                                    = (known after apply)
      + vapp_transport                          = (known after apply)
      + vmware_tools_status                     = (known after apply)
      + vmx_path                                = (known after apply)
      + wait_for_guest_ip_timeout               = 0
      + wait_for_guest_net_routable             = true
      + wait_for_guest_net_timeout              = 5

      + clone {
          + template_uuid = "4203bff4-e6ad-32c3-c23a-b0bbbacfef4a"
          + timeout       = 30

          + customize {
              + ipv4_gateway = "10.120.0.1"
              + timeout      = 10

              + linux_options {
                  + domain       = "me.local"
                  + host_name    = "k8s-master-11"
                  + hw_clock_utc = true
                }

              + network_interface {
                  + dns_server_list = [
                      + "8.8.8.8",
                      + "8.8.4.4",
                    ]
                  + ipv4_address    = "10.120.0.160"
                  + ipv4_netmask    = 24
                }
            }
        }

      + disk {
          + attach            = false
          + controller_type   = "scsi"
          + datastore_id      = "<computed>"
          + device_address    = (known after apply)
          + disk_mode         = "persistent"
          + disk_sharing      = "sharingNone"
          + eagerly_scrub     = false
          + io_limit          = -1
          + io_reservation    = 0
          + io_share_count    = 0
          + io_share_level    = "normal"
          + keep_on_remove    = false
          + key               = 0
          + label             = "disk0"
          + path              = (known after apply)
          + size              = 100
          + storage_policy_id = "19ddb546-f1f3-4da7-8058-89af965b9aa3"
          + thin_provisioned  = true
          + unit_number       = 0
          + uuid              = (known after apply)
          + write_through     = false
        }

      + network_interface {
          + adapter_type          = "vmxnet3"
          + bandwidth_limit       = -1
          + bandwidth_reservation = 0
          + bandwidth_share_count = (known after apply)
          + bandwidth_share_level = "normal"
          + device_address        = (known after apply)
          + key                   = (known after apply)
          + mac_address           = (known after apply)
          + network_id            = "dvportgroup-2036"
        }
    }

  # vsphere_virtual_machine.vm["VM2"] will be created
  + resource "vsphere_virtual_machine" "vm" {
      + annotation                              = (known after apply)
      + boot_retry_delay                        = 10000
      + change_version                          = (known after apply)
      + cpu_limit                               = -1
      + cpu_share_count                         = (known after apply)
      + cpu_share_level                         = "normal"
      + datastore_id                            = "datastore-1022"
      + default_ip_address                      = (known after apply)
      + ept_rvi_mode                            = "automatic"
      + extra_config_reboot_required            = true
      + firmware                                = "bios"
      + force_power_off                         = true
      + guest_id                                = "rhel8_64Guest"
      + guest_ip_addresses                      = (known after apply)
      + hardware_version                        = (known after apply)
      + host_system_id                          = (known after apply)
      + hv_mode                                 = "hvAuto"
      + id                                      = (known after apply)
      + ide_controller_count                    = 2
      + imported                                = (known after apply)
      + latency_sensitivity                     = "normal"
      + memory                                  = 8192
      + memory_limit                            = -1
      + memory_share_count                      = (known after apply)
      + memory_share_level                      = "normal"
      + migrate_wait_timeout                    = 30
      + moid                                    = (known after apply)
      + name                                    = "k8s-master-12"
      + num_cores_per_socket                    = 1
      + num_cpus                                = 4
      + power_state                             = (known after apply)
      + poweron_timeout                         = 300
      + reboot_required                         = (known after apply)
      + resource_pool_id                        = "resgroup-9"
      + run_tools_scripts_after_power_on        = true
      + run_tools_scripts_after_resume          = true
      + run_tools_scripts_before_guest_shutdown = true
      + run_tools_scripts_before_guest_standby  = true
      + sata_controller_count                   = 0
      + scsi_bus_sharing                        = "noSharing"
      + scsi_controller_count                   = 1
      + scsi_type                               = "pvscsi"
      + shutdown_wait_timeout                   = 3
      + storage_policy_id                       = "19ddb546-f1f3-4da7-8058-89af965b9aa3"
      + swap_placement_policy                   = "inherit"
      + tools_upgrade_policy                    = "manual"
      + uuid                                    = (known after apply)
      + vapp_transport                          = (known after apply)
      + vmware_tools_status                     = (known after apply)
      + vmx_path                                = (known after apply)
      + wait_for_guest_ip_timeout               = 0
      + wait_for_guest_net_routable             = true
      + wait_for_guest_net_timeout              = 5

      + clone {
          + template_uuid = "4203bff4-e6ad-32c3-c23a-b0bbbacfef4a"
          + timeout       = 30

          + customize {
              + ipv4_gateway = "10.120.0.1"
              + timeout      = 10

              + linux_options {
                  + domain       = "me.local"
                  + host_name    = "k8s-master-12"
                  + hw_clock_utc = true
                }

              + network_interface {
                  + dns_server_list = [
                      + "8.8.8.8",
                      + "8.8.4.4",
                    ]
                  + ipv4_address    = "10.120.0.161"
                  + ipv4_netmask    = 24
                }
            }
        }

      + disk {
          + attach            = false
          + controller_type   = "scsi"
          + datastore_id      = "<computed>"
          + device_address    = (known after apply)
          + disk_mode         = "persistent"
          + disk_sharing      = "sharingNone"
          + eagerly_scrub     = false
          + io_limit          = -1
          + io_reservation    = 0
          + io_share_count    = 0
          + io_share_level    = "normal"
          + keep_on_remove    = false
          + key               = 0
          + label             = "disk0"
          + path              = (known after apply)
          + size              = 100
          + storage_policy_id = "19ddb546-f1f3-4da7-8058-89af965b9aa3"
          + thin_provisioned  = true
          + unit_number       = 0
          + uuid              = (known after apply)
          + write_through     = false
        }

      + network_interface {
          + adapter_type          = "vmxnet3"
          + bandwidth_limit       = -1
          + bandwidth_reservation = 0
          + bandwidth_share_count = (known after apply)
          + bandwidth_share_level = "normal"
          + device_address        = (known after apply)
          + key                   = (known after apply)
          + mac_address           = (known after apply)
          + network_id            = "dvportgroup-2036"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
But apply gives me Errors:
```
╷
│ Error: error reconfiguring virtual machine: error reconfiguring virtual machine: Invalid operation for device '0'.
│
│   with vsphere_virtual_machine.vm["VM1"],
│   on main.tf line 19, in resource "vsphere_virtual_machine" "vm":
│   19: resource "vsphere_virtual_machine" "vm" {
│
╵
╷
│ Error: error reconfiguring virtual machine: error reconfiguring virtual machine: Invalid operation for device '0'.
│
│   with vsphere_virtual_machine.vm["VM2"],
│   on main.tf line 19, in resource "vsphere_virtual_machine" "vm":
│   19: resource "vsphere_virtual_machine" "vm" {
│
╵
```
